import { Metadata } from 'next';
import FaqAccordion from '../_components/FaqAccordion';

export const metadata: Metadata = {
  title: 'پرسش‌های متداول',
};

const faqData = [
  {
    question: 'چگونه می‌توانم اشتراک تهیه کنم؟',
    answer: 'شما می‌توانید با مراجعه به صفحه "خرید اشتراک" و انتخاب یکی از پلن‌های موجود، به راحتی و به صورت آنلاین اشتراک خود را تهیه کنید. پرداخت از طریق تمامی کارت‌های عضو شتاب امکان‌پذیر است.',
  },
  {
    question: 'آیا می‌توانم با یک اشتراک روی چند دستگاه تماشا کنم؟',
    answer: 'بله، بسته به نوع اشتراکی که تهیه می‌کنید، می‌توانید به صورت همزمان روی ۲ تا ۴ دستگاه مختلف فیلم تماشا کنید. لطفاً ویژگی‌های هر پلن را در صفحه خرید اشتراک بررسی کنید.',
  },
  {
    question: 'آیا امکان دانلود فیلم‌ها وجود دارد؟',
    answer: 'بله، در پلن‌های شش ماهه و یکساله، قابلیت دانلود نامحدود فیلم‌ها و سریال‌ها برای تماشای آفلاین فراهم شده است.',
  },
  {
    question: 'چگونه می‌توانم کیفیت پخش را تغییر دهم؟',
    answer: 'پلیر فیلم‌نت به صورت هوشمند کیفیت پخش را بر اساس سرعت اینترنت شما تنظیم می‌کند. با این حال، شما می‌توانید به صورت دستی نیز از طریق آیکون چرخ‌دنده در پلیر، کیفیت مورد نظر خود را از 360p تا 4K انتخاب نمایید.',
  },
  {
    question: 'آیا فیلم‌ها و سریال‌ها سانسور شده‌اند؟',
    answer: 'تمام محتوای ارائه شده در فیلم‌نت مطابق با قوانین و مقررات سازمان تنظیم مقررات رسانه‌های صوت و تصویر فراگیر (ساترا) و مناسب برای تماشا در کنار خانواده است.',
  },
  {
    question: 'چگونه می‌توانم اشتراک خود را لغو کنم؟',
    answer: 'شما می‌توانید در هر زمان با مراجعه به بخش "حساب کاربری" و قسمت "مدیریت اشتراک"، تمدید خودکار اشتراک خود را لغو کنید. اشتراک شما تا پایان دوره فعلی فعال باقی خواهد ماند.',
  },
];

export default function FaqPage() {
  return (
    <div className="bg-gray-900 min-h-screen text-white">
      <div className="container mx-auto px-4 py-16">
        <div className="text-center mb-16">
            <h1 className="text-4xl font-extrabold mb-4">پرسش‌های متداول</h1>
            <p className="text-lg text-gray-400">پاسخ سوالات خود را در اینجا پیدا کنید.</p>
        </div>
        <FaqAccordion items={faqData} />
      </div>
    </div>
  );
}